# TableCellCombinedParameterData Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableCellCombinedParameterData Class
Members See Also
---
The TableCellCombinedParameterData stores the data for combined parameters
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class TableCellCombinedParameterData : IDisposable
```

Visual Basic
---
```text
Public Class TableCellCombinedParameterData _
	Implements IDisposable
```

Visual C++
---
```text
public ref class TableCellCombinedParameterData : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..TableCellCombinedParameterData
# See Also
TableCellCombinedParameterData Members
Autodesk.Revit.DB Namespace